---
title: TemperatureRatingTypeSet
classe: Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# TemperatureRatingTypeSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `temperatureRatingTypeSet.IsEmpty` | Boolean |
| `Int32 Size { get; }` | `temperatureRatingTypeSet.Size` | Int32 |
| `Void Clear()` | `temperatureRatingTypeSet.Clear()` | Void |
| `Boolean Contains(TemperatureRatingType)` | `temperatureRatingTypeSet.Contains(item)` | Boolean |
| `Int32 Erase(TemperatureRatingType)` | `temperatureRatingTypeSet.Erase(item)` | Int32 |
| `TemperatureRatingTypeSetIterator ForwardIterator()` | `temperatureRatingTypeSet.ForwardIterator()` | TemperatureRatingTypeSetIterator |
| `IEnumerator GetEnumerator()` | `temperatureRatingTypeSet.GetEnumerator()` | IEnumerator |
| `Boolean Insert(TemperatureRatingType)` | `temperatureRatingTypeSet.Insert(item)` | Boolean |
| `TemperatureRatingTypeSetIterator ReverseIterator()` | `temperatureRatingTypeSet.ReverseIterator()` | TemperatureRatingTypeSetIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```